In [64]:
import numpy as np
from pandas import DataFrame as DF, Series, Index, value_counts
dice_rolls = np.random.choice(6, (6,4))
df_dice_rolls = DF(dice_rolls, columns=['a', 'b', 'c', 'd'])
df_dice_rolls['a'][2]= float('nan')
df_dice_rolls.loc[3] = float('nan')
display(df_dice_rolls)
display('df_dice_rolls.sum()', df_dice_rolls.sum()) ## Sums across index and return one sum per column
display("df_dice_rolls.sum(axis='columns')", df_dice_rolls.sum(axis='columns')) ## Sums across columns

display("df_dice_rolls.mean(axis='columns', skipna=False)",df_dice_rolls.mean(axis='columns', skipna=False))

     a    b    c    d
0  3.0  0.0  4.0  2.0
1  3.0  2.0  0.0  2.0
2  NaN  3.0  0.0  4.0
3  NaN  NaN  NaN  NaN
4  4.0  3.0  0.0  4.0
5  0.0  0.0  0.0  3.0

'df_dice_rolls.sum()'

a    10.0
b     8.0
c     4.0
d    15.0
dtype: float64

"df_dice_rolls.sum(axis='columns')"

0     9.0
1     7.0
2     7.0
3     0.0
4    11.0
5     3.0
dtype: float64

"df_dice_rolls.mean(axis='columns', skipna=False)"

0    2.25
1    1.75
2     NaN
3     NaN
4    2.75
5    0.75
dtype: float64

In [46]:
display(df_dice_rolls.idxmax())

a    1
b    1
c    2
d    5
dtype: int64

In [42]:
display(df_dice_rolls)
df_dice_rolls.cummax()

     a    b    c    d
0  1.0  0.0  2.0  1.0
1  4.0  2.0  2.0  1.0
2  NaN  1.0  4.0  2.0
3  NaN  NaN  NaN  NaN
4  3.0  2.0  3.0  0.0
5  2.0  2.0  2.0  5.0

     a    b    c    d
0  1.0  0.0  2.0  1.0
1  4.0  2.0  2.0  1.0
2  NaN  2.0  4.0  2.0
3  NaN  NaN  NaN  NaN
4  4.0  2.0  4.0  2.0
5  4.0  2.0  4.0  5.0

In [43]:
df_dice_rolls.describe()

              a         b         c         d
count  4.000000  5.000000  5.000000  5.000000
mean   2.500000  1.400000  2.600000  1.800000
std    1.290994  0.894427  0.894427  1.923538
min    1.000000  0.000000  2.000000  0.000000
25%    1.750000  1.000000  2.000000  1.000000
50%    2.500000  2.000000  2.000000  1.000000
75%    3.250000  2.000000  3.000000  2.000000
max    4.000000  2.000000  4.000000  5.000000

In [59]:
import numpy as np
visitors = np.random.choice(['0-16', '17-30', '17-30', '17-30', '30-45', '30-45', '45+'], 20)
visitors = Series(visitors)
display('counts', visitors.value_counts())
display('uniques', visitors.unique())

mask = visitors.isin(['0-16', '45+'])
display("isin(['0-16', '45+']", visitors[mask])

indexer = Index(['0-16', '45+']).get_indexer(visitors)
display('indexer', indexer)

'counts'

17-30    7
30-45    6
45+      4
0-16     3
dtype: int64

'uniques'

array(['30-45', '45+', '0-16', '17-30'], dtype=object)

"isin(['0-16', '45+']"

2      45+
3      45+
4     0-16
10     45+
15    0-16
17    0-16
18     45+
dtype: object

'indexer'

array([-1, -1,  1,  1,  0, -1, -1, -1, -1, -1,  1, -1, -1, -1, -1,  0, -1,
        0,  1, -1])

In [67]:
data = np.random.choice(['a', 'b', 'c', 'd', 'a', 'a', 'c'], (5, 3))
df = DF(data, columns=['col1', 'col2', 'col3'])
display(df)
display(df.apply(value_counts).fillna(0))

  col1 col2 col3
0    a    c    c
1    c    d    a
2    c    d    a
3    c    a    d
4    c    c    d

   col1  col2  col3
a   1.0     1     2
c   4.0     2     1
d   0.0     2     2

In [38]:
df.f